[
  {
    "topic_id": 0,
    "top_words": [
      [
        "diagnosis",
        0.025175129994750023
      ],
      [
        "adhd",
        0.016227344051003456
      ],
      [
        "think",
        0.015416564419865608
      ],
      [
        "never",
        0.012381927110254765
      ],
      [
        "said",
        0.011536642909049988
      ],
      [
        "told",
        0.010972538031637669
      ],
      [
        "want",
        0.009245077148079872
      ],
      [
        "say",
        0.009230786003172398
      ],
      [
        "getting",
        0.008727586828172207
      ],
      [
        "friend",
        0.00841308943927288
      ]
    ],
    "representative_docs": [
      {
        "doc_idx_in_corpus": 52,
        "topic_score": 0.8224450945854187,
        "type": "post",
        "doc_id": "P_2",
        "post_id": "P_2",
        "parent_post_id": null,
        "subreddit": "AutisticAdults",
        "keyword": "ABA",
        "submission_score": 89,
        "raw_text": "I worked in ABA and felt that my experience was weird Wasn't sure where else to take this, but I just wanted to share incase someone could relate or just listen. I'll divide my post into sections as it'll be long.\n\nBeginning:\n\nI started working in ABA when I was 20. I was a college student and wasn't sure exactly what I wanted to do at the time, and got hired with no experience. After a quick onboarding process, I was told to meet at a client's home, where BCBAs would be present to assist or train me I guess.\n\nFrom the moment I started, it all just felt insanely quick. Honestly, I didn't even know what ABA was, or what it entailed, until that day where I was just at the client's home. I knew it was some sort of therapy for autistic children of course, but I really had no clue as to how it worked, or anything else about it at all. So the first thing I felt was strange about my experience I guess, is how quickly I was thrown into it all, without any sort of formal training or debrief as to how things were to be done. \n\nMy issue at the time was that, I felt it to be inappropriate for things to be done this way, as you're dealing with something as sensitive as a child's wellbeing and development. Just to throw someone who has no idea of what was going on in the mix and having them give this child \"therapy\"?\n\nI continued with it and slowly picked up what I was supposed to have these children do over a course of several weeks. These were generally simple tasks, such as requiring a child to do or say certain things, then rewarding them (usually with food, or allowing them to do something of their choice). I was given about 6 or 7 clients to start off, some were high functioning and others were medium functioning, and some were nonverbal? *sorry, I'm not sure what the appropriate terms are, these were just the terms we used where I worked.\n\nAbout a few weeks in, the owner of the company who is also a bcba, asks me to meet for lunch. So we meet, and we talk. Small conversation, nothing out of the ordinary. At the end of the very casual, 30-45 minute lunch, she asks \"can I give you a hug?\", and so, we hug. She lets out and \"aww\" almost like she's hugging a child and not a 20y woman, but I didn't think too much of it (Foreshadowing...).\n\nMiddle/end point (3/4 months in):\n\nThe company I worked for opened up a formal location, which was basically a studio space with one bathroom and a kitchen. It was essentially a place for all the rbt techs, bcbas, and clients to gather and work in group sessions.\n\nUp until this point, I hadn't met too many people in the company, but here, I got to meet most of my coworkers, and superiors I suppose. A good amount of people I met were also college students. \n\nMostly everyone I met was at least, outwardly nice. During our first week, there were about 10 employees that would stay til closing. I was one of them, and after all the kids left was when I really got to see my coworkers' personalities come out, rather than their standard E rated work hours persona. They were fun, normal people, joked, used profanities with eachother that they couldn't use infront of the kids, etc, and all seemed to get along well.\n\nHowever as I continued to work there, I began to notice that my coworkers treated me differently than they treated everyone else. This is a conversational exchange that I think best highlights what I'm trying to get at:\n\n*I walk into work as normal, say hi to coworkers and kids*\n\nBCBA #1: \"Hi miss [my first name]! What have you got there?\" *pointing to my lunch bag*\n\nMe: \"I made sweet potatoes and beef for lunch\"\n\nBCBA #1: \"Oh my goodness! That sounds amazing!\" *calls over other BCBAs* \"Miss [my first name] made herself lunch today! Isn't that awesome?\"\n\nBCBA #2: \"WOW! Miss [my first name], do you like to cook?\"\n\nMe: \"Yeah\"\n\nBCBA #3: \"That's so awesome!\" *claps* \n\nMe: *confused* \n\nMy three BCBAs were so excited for what? My insanely great accomplishment of packing myself lunch? Everyday, they would hype me up for doing literally anything, all in an exaggerated, animated, and celebratory way every single time. Ex: One time we had catered chicken wings to work, and they celebrated me for trying all of the flavors. Another time they told me I was SO SMART!!! For helping one of the kids with 2nd grade math homework. They would also often tell me how PROUD they were of me, and ask if they could hug me when I completed menial work tasks that were expected of everyone.\n\nIt bothered me that my coworkers treated me this way because they sure as hell didn't treat eachother like that. I couldn't really figure out exactly what it was for months and just dealt with it, it was just work after all, and I didn't want to let myself become overly bothered by it. I thought maybe, they were just all patronizing me? But one day it finally clicked -- they treated me exactly the same way they treated the children, because they thought I was autistic. \n\nLets take a step back -- I have not been diagnosed as autistic, though I have been told by several people close to me that I seem to be. I've noticed myself too, that I do have seemingly autistic traits, behaviors, whatever you'd call them, but ultimately I've never been affected enough by it to actually seek a diagnosis. Whether I'm autistic or not, I function enough to get by as an adult. \n\nIt became increasingly clear after I had that realization, and difficult to ignore. They treated me like a pet or something. So much dumber than them, so when I do literally anything, it's a huge accomplishment and I should be praised and celebrated. I'm so cute and smart for...doing the tasks I'm paid to do?\n\nIt hurt knowing that the kids were treated the same way, if not worse. I remember one of  coworkers saying that she never wanted kids until she started working here, because after she met autistic children, she realized how \"adorable\" they are. Are they any cuter than neurotypical children, just because they're autistic? \n\nPeople feel bad because they think autistics are less than them. Then they develop this savior-complex, believing that they can better these autistic children's lives by feeding them a chicken nugget everytime they make eye contact while speaking. Treating these children as if they're dogs, and rewarding them when they do the trick you asked them to, isn't as meaningful as you think it is. And seeing someone as inherently less than you doesn't make you a better person. But my coworkers genuinely thought they were contributing to the greater good. A constant phrase you'd hear everyday is \"this job is tough but it's so rewarding!\"\n\nI don't mean to demonize ABA therapy in it's entirety. I know some people feel it's helped them, and some are completely traumatized by it. I'm not too certain about any of it, but I know for sure that the environment that I worked in felt unethical. At least half of the staff were uncertified, also. No formal training, just jumping straight into giving therapy! \n\nI left soon after that, and it's been a long time since then. I guess I've been thinking about that experience because I've seen a lot more people get into that field, and I clearly have some strong feelings about it.",
        "processed_text": "worked aba felt experience weird sure else take wanted _ share incase someone relate listen divide post section long beginning started working aba college student sure exactly wanted hired experience quick onboarding process told meet home bcbas present assist train guess moment started felt insanely quick honestly aba entailed day home knew sort therapy course clue worked anything _ else first felt strange experience guess quickly thrown sort formal training debrief done issue felt inappropriate done way dealing something sensitive wellbeing development throw someone idea mix give therapy continued slowly picked supposed course several week generally simple task requiring say certain rewarding given client start high _ functioning others medium functioning nonverbal sorry sure appropriate term term used worked week owner company bcba asks meet lunch meet talk small conversation nothing ordinary end casual minute lunch asks give hug hug let aww almost hugging woman think point company worked opened formal location basically studio space bathroom kitchen essentially place rbt tech bcbas client gather work group session point met many company meet coworkers superior suppose good amount met college student mostly everyone met least outwardly nice first week employee stay closing left see coworkers personality come rather standard rated work hour persona fun normal joked used profanity eachother use infront etc seemed along however continued work began notice coworkers treated differently treated everyone _ else conversational exchange think best highlight trying walk work normal say hi coworkers bcba hi miss first name pointing lunch bag made sweet potato beef lunch bcba goodness sound amazing call bcbas miss first name made lunch today awesome bcba wow miss first name cook yeah bcba awesome clap confused bcbas excited insanely great accomplishment packing lunch everyday hype literally anything exaggerated animated celebratory way single ex catered chicken wing work celebrated trying flavor told smart helping grade math homework often tell proud ask hug completed menial work task expected everyone bothered coworkers treated way sure hell treat eachother figure exactly month dealt work want let become overly bothered thought maybe patronizing day finally clicked treated exactly way treated thought let take step back diagnosed told several close seem noticed seemingly trait behavior call ultimately never affected enough actually seek diagnosis function enough adult became increasingly clear realization difficult ignore treated pet something dumber literally anything huge accomplishment praised celebrated cute smart task paid hurt knowing treated way remember coworkers saying never wanted started working met realized adorable cuter neurotypical feel bad think autistics less develop believing better life feeding chicken nugget everytime eye _ contact speaking treating dog rewarding trick asked meaningful think seeing someone inherently less better person coworkers genuinely thought contributing greater good constant phrase hear everyday job"
      },
      {
        "doc_idx_in_corpus": 181,
        "topic_score": 0.7872157096862793,
        "type": "comment",
        "doc_id": "C_P_7_8224",
        "post_id": "P_7",
        "parent_post_id": "P_7",
        "subreddit": "AutisticWithADHD",
        "keyword": "diagnosis",
        "submission_score": 195,
        "raw_text": "I agree that I wrote my post in an angry manner, but I didn’t exaggerate anything I said. I think what I’m the most frustrated about is the uncertainty and confusion they gave me. I’d be happy to acknowledge that all my symptoms are due to trauma! but they didn’t say that either!!They just kind of left me in the dark with some claims of “these are your symptoms but we can’t make any claims. I already know what my symptoms are. I’m basically left with not much more then I came there for. I think they didn’t do a thorough enough job and I think its weird that they want to prescribe me adhd medication, but not acknowledge whether I have adhd. It could just be that they’re shit at their job. Either way I’m going for that second opinion and hope it’ll be more clear, regardless of what the outcome of the diagnosis is. I don’t WANT adhd. In fact I’d rather not have it!! I didn’t watch one tiktok and go “oh I can’t sit still so I must have adhd”. No. I did months and months or research and contemplation and talked to so many people and all my friends are diagnosed AuDHD’ers and I relate so much to them. A lot of my family members show autism and adhd traits but they’re very ignorant and I’ve been invalidated for all my problems for so many years. So excuse me for getting a little mad when the people that are assessing me aren’t doing a thorough job and come back with confusing and inconclusive claims.",
        "processed_text": "agree wrote post angry manner exaggerate anything said think frustrated uncertainty confusion gave happy acknowledge symptom due trauma say kind left dark claim symptom claim already symptom basically left came think enough job think weird want prescribe adhd medication adhd shit job way second_opinion hope clear regardless outcome diagnosis want adhd fact rather watch tiktok go oh sit adhd month month research contemplation talked many friend diagnosed relate lot family_member show adhd trait ignorant invalidated problem many excuse getting little mad assessing thorough job come back confusing inconclusive claim"
      },
      {
        "doc_idx_in_corpus": 173,
        "topic_score": 0.7830063104629517,
        "type": "comment",
        "doc_id": "C_P_6_1292",
        "post_id": "P_6",
        "parent_post_id": "P_6",
        "subreddit": "Autism_Parenting",
        "keyword": "diagnosis",
        "submission_score": 157,
        "raw_text": "That’s how I felt too, just last week we got our diagnosis. It took me 6 years to get here, with several attempts at testing and doctors saying he was “on the edge of the spectrum” or too social to qualify and he was just “a complicated kid.” I teared up out of relief, anger, frustration, and a bit of sadness. But to finally have a doctor who took the time to get to know him over multiple visits, two ADOS tests 6 months apart and several conversations on the phone it felt like I finally got a doctor who really saw him and his challenges and was able to see the whole complicated picture. I second guessed myself so many times over these years that it was just his ADHD, just his anxiety, or just being a bit socially immature but I knew he needed more help than I was able to give him and now I can advocate for him in school for more help with this at my back. It’s a hard journey I think, no matter what your timeline is.",
        "processed_text": "felt last_week diagnosis took several attempt testing doctor saying edge spectrum social qualify complicated teared relief anger frustration bit sadness finally doctor took multiple visit ado test month apart several conversation phone felt finally doctor saw challenge able see whole complicated picture second guessed many adhd anxiety bit socially immature knew needed help able give advocate school help back hard journey think matter timeline"
      },
      {
        "doc_idx_in_corpus": 195,
        "topic_score": 0.728678286075592,
        "type": "comment",
        "doc_id": "C_P_7_6103",
        "post_id": "P_7",
        "parent_post_id": "P_7",
        "subreddit": "AutisticWithADHD",
        "keyword": "diagnosis",
        "submission_score": 195,
        "raw_text": "I get how frustrating this can be. On the other hand, sometimes treatment of one diagnosis is necessary in order to reveal the other potential diagnoses.\n\nAs an example, I was “diagnosed” with giftedness as a child. I only encountered issues that couldn’t be explained by giftedness when I started my PhD, resulting in my ADHD diagnosis. I actually visited the psychiatrist for potential autism symptoms, but the psychiatrist told me that she couldn’t tell whether I was autistic or not, because my symptoms of autism might also be caused by giftedness or ADHD. Many years later, after a career switch to teaching (a much more social environment), I finally encountered issues that couldn’t be explained by giftedness or ADHD, leading to my autism diagnosis at 30 yo. I feel like the picture is complete now: a combination of giftedness, ADHD and autism.\n\nWithout ADHD treatment, it would have been hard to distinguish my autism, so those years between diagnoses were not lost. Similarly, I think you should start therapy for autism and trauma, and see how your ADHD symptoms evolve. ADHD symptoms might be caused or worsened by things like trauma and depression, so they might want to get a clearer picture by treating the known issues (autism and trauma) first.\n\nGood luck, I hope you’ll find the support you need (regardless of the associated diagnosis).",
        "processed_text": "frustrating hand sometimes treatment diagnosis necessary order reveal potential diagnosis example diagnosed giftedness encountered issue explained giftedness started phd resulting adhd diagnosis actually visited psychiatrist potential symptom psychiatrist told tell symptom caused giftedness adhd many later career switch teaching finally encountered issue explained giftedness leading diagnosis yo feel picture complete combination giftedness adhd adhd treatment hard distinguish diagnosis lost similarly think start therapy trauma see adhd symptom evolve adhd symptom caused worsened trauma depression want clearer picture treating known issue first good_luck hope support need"
      },
      {
        "doc_idx_in_corpus": 58,
        "topic_score": 0.6357331275939941,
        "type": "comment",
        "doc_id": "C_P_2_1859",
        "post_id": "P_2",
        "parent_post_id": "P_2",
        "subreddit": "AutisticAdults",
        "keyword": "ABA",
        "submission_score": 89,
        "raw_text": "My wife, child, and I are all autistic.  My wife is an ABA therapist because she wanted to make a difference.  The first company she worked at sounds exactly like the experience you had and it as appalling.  The main goal of ABA is to make kids \"functional\" but all they're doing is teaching kids to mask to get by and that's one of the most damaging things you can do to an autistic person's health.  I was late diagnosed and I'm still trying to recover and unmask and it's not an easy process by any means.  I couldn't imagine having therapy that burned it into my brain.  I can only imagine how much worse that makes it.  Then the whole treating autistic kids like they're less than others is just repulsive and ignorant.  Just because your brain works differently doesn't mean in any way that you're incapable you literally just function different.  To treat them as less than human is despicable to say the least and is nothing but damaging.  I'm really sorry that you had this experience.  It was unfair and dehumanizing to say the least.  My wife  joined ABA therapy to make a difference and actually give the kids proper help and teach them not to mask.  The clinic she works at currently is all about proper treatment and does not try and force them to suppress it.  It really just depends on where you work.  But the people at the place you were at needs a serious reality check.  There's no chance that they are helpful if they are that ignorant.  Once again I'm sorry you had to deal with and witness this it's very hard to even listen to because it's so wrong.  If you're having thoughts that you may be autistic I would suggest seeking a diagnosis because if you are it will only improve your life I promise.  The world can be a shitty place but we can make little differences and it's sad to see people in a position to do so do nothing but cause harm.  I fully understand where you're coming from and I 100% agree with the things that you have said.  And on that note, I would like to end this by saying to remember that no matter what you do or who you are valuable and that you matter<3",
        "processed_text": "wife wife aba therapist wanted difference first company worked sound exactly experience appalling main goal aba functional teaching mask damaging health late_diagnosed trying recover unmask easy process mean imagine therapy burned brain imagine worse whole treating less others repulsive ignorant brain work differently mean way incapable literally function different treat less human despicable say least nothing damaging sorry experience unfair dehumanizing say least wife joined aba therapy difference actually give proper help teach mask clinic work currently proper treatment try_force suppress depends work place need serious reality check chance helpful ignorant sorry deal witness hard listen wrong thought suggest seeking diagnosis improve life promise world shitty place little difference sad see position nothing cause_harm fully_understand coming agree said note end saying remember matter valuable"
      }
    ]
  },
  {
    "topic_id": 1,
    "top_words": [
      [
        "diagnosis",
        0.04802331328392029
      ],
      [
        "asd",
        0.0239506047219038
      ],
      [
        "diagnosed",
        0.02088366076350212
      ],
      [
        "support",
        0.020009996369481087
      ],
      [
        "adhd",
        0.016134662553668022
      ],
      [
        "condition",
        0.016049271449446678
      ],
      [
        "struggle",
        0.015970861539244652
      ],
      [
        "understanding",
        0.014896951615810394
      ],
      [
        "self",
        0.014675226993858814
      ],
      [
        "facial",
        0.0125662200152874
      ]
    ],
    "representative_docs": [
      {
        "doc_idx_in_corpus": 197,
        "topic_score": 0.7136999368667603,
        "type": "comment",
        "doc_id": "C_P_8_2319",
        "post_id": "P_8",
        "parent_post_id": "P_8",
        "subreddit": "Autism_Parenting",
        "keyword": "masking",
        "submission_score": 49,
        "raw_text": "It used to be different diagnoses (Asperger's, autism or PDD).\n\nThe main reason they changed it to a spectrum of ASD is because it's difficult to differentiate them all individually with certainty.  New research at the time suggested that there was a significant overlap between Asperger’s and other forms of autism.  \n\nIt was also confusing because someone could be diagnosed with classic autism as a toddler because they didn't talk, etc, but then as they grew up, they no longer met the criteria for classic autism and now met the criteria for Asperger's instead.  It was hard to completely change diagnoses.\n\nAnother reason was because even though Asperger's, PDD and autism were all clearly linked, having them as completely separate diagnoses encouraged division rather than inclusion.  Before combining them, anyone with an 'autism' diagnosis was automatically stigmatized as having low intelligence.  And anyone diagnosed with Asperger's was automatically stigmatized as having very high intelligence and not needing any support.\n\nIt was really hard for people diagnosed with Asperger's to access support services because their normal/high IQ meant they were brushed off and prejudiced as not needing any help because they appeared more \"normal\".\n\nEven though they might have just appeared more neurotypical because they were constantly masking which was exhausting for them, or they had sensory issues that caused them to greatly struggle in the school/work environment and they desperately did need help.\n\nAnd then those diagnosed with classic autism, were brushed off as 'won't ever get far in life', chuck them in an institution because they are beyond help. \n\nThat's why it was changed to levels of how much help/support they need.  By combining them, it helps the Level 3 ASD people not be written off as low intelligence, and helps the Level 1 ASD people not be written off as totally fine and not requiring support.",
        "processed_text": "used different diagnosis main_reason changed spectrum asd difficult differentiate individually certainty new research suggested significant overlap form confusing someone diagnosed classic toddler talk etc grew longer met criterion classic met criterion instead hard completely change diagnosis reason pdd clearly linked completely separate diagnosis encouraged division rather inclusion combining anyone diagnosis automatically stigmatized low intelligence anyone diagnosed automatically stigmatized high intelligence needing support hard diagnosed access support service iq meant brushed prejudiced needing help appeared normal appeared neurotypical constantly masking exhausting sensory issue caused greatly struggle environment desperately need help diagnosed classic brushed ever far life chuck institution help changed level need combining help level asd written low intelligence help level asd written totally fine requiring support"
      },
      {
        "doc_idx_in_corpus": 196,
        "topic_score": 0.5645875930786133,
        "type": "post",
        "doc_id": "P_8",
        "post_id": "P_8",
        "parent_post_id": null,
        "subreddit": "Autism_Parenting",
        "keyword": "masking",
        "submission_score": 49,
        "raw_text": "Need help understanding how non-verbal (level 3) autism can be the same diagnosis as high masking (level 1) — clinical POV appreciated  Today’s ND world describes autism on a pinwheel rather than a line with each individual expressing varying differences in sensory, gross motor, executive functioning, and other key areas related to ASD. For the experts out here, I’m struggling to understand how non-verbal/level 3 (as a ND person myself I don’t like the levels, but using for illustrative purposes) autistic individuals are part of the same diagnosis as a high masking, gifted, presentation? I can understand the phrase, if you’ve met someone with autism you’ve met one person with autism. \n\nAny resources to help me understand the complexity of autism that you all recommend?",
        "processed_text": "need help understanding diagnosis high_masking clinical pov appreciated nd world describes pinwheel rather line individual expressing varying difference sensory gross motor executive_functioning key area related expert struggling understand individual part diagnosis high_masking gifted presentation understand phrase met someone met person resource help understand complexity recommend"
      },
      {
        "doc_idx_in_corpus": 179,
        "topic_score": 0.5375027656555176,
        "type": "post",
        "doc_id": "P_7",
        "post_id": "P_7",
        "parent_post_id": null,
        "subreddit": "AutisticWithADHD",
        "keyword": "diagnosis",
        "submission_score": 195,
        "raw_text": "I am in rage (diagnosis results) Today I got my diagnosis results back. \n\nThey were like “yeah, we diagnosed you with autism, but you’re not like the “typical, REAL autistics”. You don’t adhere to rigid routines and you CAN be social so you’re really high functioning, you’re actually barely autistic, we were reluctant to diagnose you actually. They think that “spectrum” means “more or less” autistic. So that was already enraging. \n\nThen there was the adhd part. \n“You have 8 out of 9 attention deficit symptoms, but you don’t try to finish other people’s sentences and you don’t jump around the room. So you can’t have adhd. Your problems with attention can be due to other factors. It also started around middle school so you weren’t like this as a child. (My parents probably helped with that by saying I was “such a good kid and never caused any problems”)\n\nAnd then trauma. \n“There were certain events that caused you to be under a lot of pressure psychologically for a really long time, and you’re lightly susceptible to a psychotic break, BUT WE HAVE TO BE CAREFUL TO CALL IT TRAUMA.” \n\nWHY CANT THEY JUST SAY WHAT IT IS. I am crying. It’s like it’s NOT ENOUGH. And although I know my problems and issues and pain is valid, I guess I was just hoping for a clear result so that there could be a clear way of dealing with it and that I can understand myself and move on. But I just feel more frustrated. By the time I could ask questions they were like “oh look at the time, you have to go, I’ll send you the report”. \n\nI know that simply “labling” people is bad and dangerous. You should give more of an explanation in what it means for that person specifically and how it interferes with their other life experiences and stuff. But a diagnosis is not just a label. It’s a lifeboat. A way to know that you’re not just “wrong” and that there’s a REASON you struggle with certain things. Of course it means something else for everyone, I totally agree with that! But that doesn’t mean you have to refrain from it because someone doesn’t fit EVERY single diagnostic criteria doesn’t portray a very stereotypical expression of the condition! I guess I thought they were further than that but I was wrong. I am furious. Now I’m doubting myself even more and oscillating between rage towards them and self doubt because “maybe they’re right, they are the “professionals” after all”.",
        "processed_text": "rage today diagnosis result back yeah diagnosed typical real autistics adhere rigid routine social high_functioning actually barely reluctant diagnose actually think spectrum mean less already enraging part attention_deficit symptom try finish sentence jump room adhd problem attention due factor started middle_school trauma certain event caused lot pressure psychologically long lightly susceptible psychotic break careful call trauma say cry enough problem issue pain valid guess hoping clear result clear way dealing understand move feel frustrated ask question look go send report simply labling bad dangerous give explanation person specifically interferes life experience stuff diagnosis label lifeboat way wrong reason struggle certain course mean something_else everyone totally_agree mean refrain someone fit single diagnostic criterion portray stereotypical expression condition guess thought wrong furious doubting oscillating rage towards self doubt maybe right professional"
      },
      {
        "doc_idx_in_corpus": 3854,
        "topic_score": 0.4552016854286194,
        "type": "comment",
        "doc_id": "C_P_203_1406",
        "post_id": "P_203",
        "parent_post_id": "P_203",
        "subreddit": "autism",
        "keyword": "diagnosis",
        "submission_score": 523,
        "raw_text": "Don’t make too much of those tests.  They score high for things like bipolar disorder.  \n\nUnlike what we are told in social media, things like ‘stimming’, sensitivities, social problems, etc., are found in most persons with non-autistic mental health disorders and at high rates in the general population. These things do not necessarily suggest autism.\n\n \n\nSo-called “autism” tests, like AQ and RAADS and others have high rates of false positives, labeling you as autistic VERY easily. If anyone with a mental health problem, like depression or anxiety, takes the tests they score high even if they DON’T have autism.\n\n\"our results suggest that the AQ differentiates poorly between true cases of ASD, and individuals from the same clinical population who do not have ASD \"\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4988267/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4988267/)\n\n \n\n\"a greater level of public awareness of ASD over the last 5–10 years may have led to people being more vigilant in ‘noticing’ ASD related difficulties. This may lead to a ‘confirmation bias’ when completing the questionnaire measures, and potentially explain why both the ASD and the non-ASD group’s mean scores met the cut-off points, \"\n\n[https://link.springer.com/article/10.1007/s10803-022-05544-9](https://link.springer.com/article/10.1007/s10803-022-05544-9)\n\n \n\nRegarding AQ, from one published study. “The two key findings of the review are that, overall, there is very limited evidence to support the use of structured questionnaires (SQs: self-report or informant completed brief measures developed to screen for ASD) in the assessment and diagnosis of ASD in adults.”\n\n \n\nRegarding RAADS, from one published study. “In conclusion, used as a self-report measure pre-full diagnostic assessment, the RAADS-R lacks predictive validity and is not a suitable screening tool for adults awaiting autism assessments”\n\n[The Effectiveness of RAADS-R as a Screening Tool for Adult ASD Populations (hindawi.com)](https://www.hindawi.com/journals/aurt/2021/9974791/)\n\n \n\nRAADS scores equivalent between those with and without ASD diagnosis at an autism evaluation center:\n\n \n\n[Examining the Diagnostic Validity of Autism Measures Among Adults in an Outpatient Clinic Sample - PMC (nih.gov)](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8992806/)",
        "processed_text": "test score_high bipolar_disorder told social medium stimming sensitivity social problem etc found person mental_health disorder high rate general_population necessarily suggest test aq raads others high rate false positive labeling easily anyone mental_health problem depression_anxiety take test score_high result suggest aq differentiates poorly true case asd individual clinical population asd greater level public awareness last led vigilant noticing asd related difficulty lead confirmation completing questionnaire measure potentially explain asd mean score met point regarding_aq published_study key finding review_overall limited_evidence support use structured questionnaire sqs informant_completed brief measure developed_screen asd assessment diagnosis asd adult regarding_raads published_study conclusion used measure diagnostic assessment lack predictive_validity suitable_screening tool adult awaiting assessment effectiveness screening_tool adult asd population raads score equivalent asd diagnosis evaluation center examining diagnostic validity measure adult outpatient clinic sample pmc"
      },
      {
        "doc_idx_in_corpus": 1325,
        "topic_score": 0.4439558982849121,
        "type": "comment",
        "doc_id": "C_P_44_690",
        "post_id": "P_44",
        "parent_post_id": "P_44",
        "subreddit": "neurodiversity",
        "keyword": "ADHD",
        "submission_score": 14,
        "raw_text": "I have both autism and adhd and I can completely understand how with having both, it can be difficult to pinpoint everything to whether it is autism, adhd, or both. Autism and ADHD have different dsm 5 criteria, and not everyone who is autistic meets the criteria for ADHD and not everyone with ADHD meets the criteria for autism. ADHD has recently been noticed to be very different from autism even with some similar symptoms, and the spectrum for ADHD isn't the same for autism. The spectrum for ADHD is: inattentive, combined, and hyperactive/impulsivity, while the spectrum for autism is level 1 high functioning low support needs, level 2 moderate support needs, and level 3 high support needs low functioning. They mean different things. I'm level 2 autistic person with combined adhd and I meet the criteria for both of them and need support and treatment for both while those who have one or the other have different treatment plans.",
        "processed_text": "adhd completely understand difficult pinpoint everything adhd adhd different dsm criterion everyone meet criterion everyone adhd meet criterion adhd recently noticed different similar symptom spectrum adhd spectrum adhd inattentive combined spectrum level high_functioning low_support need level moderate support need level high_support need low functioning mean different level person combined adhd meet criterion need support treatment different treatment plan"
      }
    ]
  },
  {
    "topic_id": 2,
    "top_words": [
      [
        "sedation",
        0.035420216619968414
      ],
      [
        "early",
        0.032646067440509796
      ],
      [
        "pretty",
        0.025447456166148186
      ],
      [
        "creepy",
        0.02492321841418743
      ],
      [
        "procedure",
        0.024857206270098686
      ],
      [
        "teeth",
        0.02438316121697426
      ],
      [
        "next",
        0.022022508084774017
      ],
      [
        "completely",
        0.01840147189795971
      ],
      [
        "eat",
        0.018061285838484764
      ],
      [
        "subject",
        0.017726827412843704
      ]
    ],
    "representative_docs": [
      {
        "doc_idx_in_corpus": 6,
        "topic_score": 0.46095970273017883,
        "type": "comment",
        "doc_id": "C_P_1_5542",
        "post_id": "P_1",
        "parent_post_id": "P_1",
        "subreddit": "Autism_Parenting",
        "keyword": "ABA",
        "submission_score": 77,
        "raw_text": "I’m fed up of even apologizing about “old “ ABA. Autism used to be diagnosed primarily on severe cases and rarely on HFA except if the child was nonverbal until five years old , once they started to speak they were diagnosed with Asperger’s which was not prescribed ABA. People don’t seem to remember how primitive was autism acceptance back in the day, severely autistic people were locked up in institutions as young as two years old, by physician orders and many times even against parental consent (look up Bruno Bettelheim parentonomy). ABA science utilized on autism was kinda progressive , it was against the establishment of  what the fate of these autistics was supposed to be, against traditional psychiatric guidelines of the time. The ABA goals were to help those severely autistic children avoid early institutionalization through acquisition of basic life skills and beyond, not to secure a linear normative trajectory of successful adulthood from college to the workplace to start a family and retire. We’re talking about the 60’s , 70’s and early 80’s , going from sterile labs to university workshops and experimental pilot school programs, and HFA autistic subjects were slowly introduced in those programs in the early 90’s , they had ready to learn skills and did not need the kind of intensive customized teaching severe autism warrants, and these HF subjects (who by the way were a minority of minority) felt rightfully insulted to be treated as (get ready to get offended) “dumb”. That’s what it really is.  That’s why most of these activists deny severe autism even exists, because severely autistics do benefit from ABA and that pisses off the activists to no end",
        "processed_text": "fed apologizing old aba used diagnosed primarily severe case rarely hfa nonverbal old started speak diagnosed prescribed aba seem remember primitive acceptance back day severely locked institution young old physician order many parental consent aba science utilized kinda progressive establishment fate autistics supposed traditional psychiatric guideline aba goal help severely avoid early institutionalization acquisition basic life skill secure linear normative trajectory successful adulthood college workplace start family retire talking early sterile lab university workshop experimental pilot school program hfa subject slowly introduced program early ready learn skill kind intensive customized teaching severe warrant hf subject felt rightfully insulted treated dumb activist deny severe exists severely autistics benefit aba piss activist end"
      },
      {
        "doc_idx_in_corpus": 142,
        "topic_score": 0.3394937813282013,
        "type": "comment",
        "doc_id": "C_P_4_7103",
        "post_id": "P_4",
        "parent_post_id": "P_4",
        "subreddit": "autism",
        "keyword": "ABA",
        "submission_score": 562,
        "raw_text": "There's a middle ground ya know. If your child weren't autistic, but was bothering others although being their true selves, what would you do?\n\nHave you considered \"shh you're getting a little loud please,\" and treating them like a regular human? Also be advised the humming may be because of the increased stimulation. If the world is too loud and bright as your child's senses develop, it's easier to control it with your own noise. I joke around sometimes with it, but tbh I play trumpet as a form of stimming as an adult. When the world gets loud it's nice to be able to go home and be LOUDER still myself but in a way that I control, and it helps.\n\nSo... If they're humming because they are happy, sure let it go. If they're humming because they're overstimulated, you can figure that out you just gotta observe closer. But be aware the line you have to walk here as the parent and the line they have to walk later getting older, is basically how to cope. Your child won't WANT people to avoid them in the store because they think they're weird. While I agree ABA sounds awful, please don't overreact the other direction and avoid all teaching \"because they are autistic.\" Your child at 20 will NOT be thankful to you for giving them zero coping skills and leaving them as an adult to figure out all of the social rules by themselves. But nor will they like having been raised oppressed and told they can't be themselves. You gotta walk the line between acceptance and preparation here.\n\nEnd rant.\n\nPS my mom was horribly abusive. I used to hum while eating as a child because I was exceedingly happy while eating and it's how I showed it. She yelled at me. A lot. Until I stopped. This post kind of hit a nerve for me. I'm glad I don't eat noisily now, but we'll never know if I would have grown out of it on my own. The one thing that resulted for SURE is my mom's doesn't get \"happy holidays, I miss you\" phone calls now as an adult.",
        "processed_text": "middle_ground ya bothering others true self considered shh getting little loud please treating regular human advised humming increased stimulation world loud bright sens develop easier control noise joke sometimes tbh play trumpet form stimming adult world loud nice able go home louder way control help humming happy sure let go humming overstimulated figure gotta observe closer aware line walk line walk later getting older basically cope want avoid store think weird agree aba sound awful please overreact direction teaching thankful giving zero coping skill leaving adult figure social rule raised oppressed told gotta walk line acceptance preparation end rant p mom horribly abusive used hum eating exceedingly happy eating showed yelled lot stopped post kind hit nerve glad eat noisily never grown resulted sure happy holiday miss phone_call adult"
      },
      {
        "doc_idx_in_corpus": 43,
        "topic_score": 0.32958388328552246,
        "type": "comment",
        "doc_id": "C_P_1_2805",
        "post_id": "P_1",
        "parent_post_id": "P_1",
        "subreddit": "Autism_Parenting",
        "keyword": "ABA",
        "submission_score": 77,
        "raw_text": "Thanks for this even though I'm not OP. I keep going back and forth with fear with ABA just cuz of all the damn anti-ABA out there. And now I'm hearing that alot of this abuse with ABA is pretty much in the past when it first started....which makes alot of sense since I haven't heard any recent stories. And sadly it's also true alot of atypical parents judge just as much as NTs. I've been judged more than a few times for being afraid for my son, claiming I must not be grateful enough for my son because I'm worried about his future with autism ect ect, but all some of these community parents seem to think about is \"what is the best way to claim struggling parents with autistic kids arnt scared, but just UNGRATEFUL for their kids because they're different.\" Like gimme a damn break and lemme be fucking understandbly scared because my SON was just DIAGNOSED with a DISORDER and quit acting like I should be overjoyed about my boys autism for some reason.",
        "processed_text": "thanks op keep back_forth fear cuz damn hearing alot aba pretty first alot sense heard recent story sadly true alot atypical judge nt judged afraid son claiming grateful enough son worried future ect ect community seem think best way claim struggling arnt scared ungrateful different gimme damn break lemme fucking understandbly scared son diagnosed disorder quit acting overjoyed reason"
      },
      {
        "doc_idx_in_corpus": 89,
        "topic_score": 0.24990014731884003,
        "type": "comment",
        "doc_id": "C_P_4_3599",
        "post_id": "P_4",
        "parent_post_id": "P_4",
        "subreddit": "autism",
        "keyword": "ABA",
        "submission_score": 562,
        "raw_text": "If you said “I am autistic myself and ABA greatly improved my life and is the reason why I have a relationship with my wife” for example I would back you. But you’re a selfish, self assuring parent who wants to hide behind your wife’s fancy titles. My father has a phd and is a wonderful educator, didn’t stop him from physically and emotionally abusing me. \n\nAutistic children after ABA grow to be traumatised adults. Sorry. It’s a short term dog training dehumanising solution. \n\nI’m saying this as a person whose parents practiced ABA elements to “revoke” unwanted behaviours or stims, completely harmless, who is a completely fucked up 30 year old and on antidepressants until the end of my life. It’s not because of autism, trust me.",
        "processed_text": "said aba greatly improved life reason relationship wife example back selfish self assuring want hide fancy title father phd wonderful educator stop physically emotionally abusing aba grow traumatised adult sorry short_term dog_training dehumanising solution saying person practiced aba element revoke unwanted behaviour stims completely harmless completely fucked old antidepressant end life trust"
      },
      {
        "doc_idx_in_corpus": 344,
        "topic_score": 0.19442851841449738,
        "type": "comment",
        "doc_id": "C_P_13_357",
        "post_id": "P_13",
        "parent_post_id": "P_13",
        "subreddit": "AutisticAdults",
        "keyword": "ABA",
        "submission_score": 164,
        "raw_text": "There has been a recent push for ABA in K-12 public schools to \"meet students' social and emotional needs\". It does not meet either of those things. ABA practices are operant conditioning practices - the lowest order of psychological conditioning. Operant conditioning is akin to programming a robot - specific input leads to specific output. If the subject exhibits output other than that expected by the operator, a form of punishment is administered and the steps are related. Punishment is always the removal of something. When the subject returns the operator's intended output, a form of reward is administered .\n\nThe reason ABA is abusive is simply because it dictates to the subject how they need to behave without any consideration or context of the subject as an individual human being. It is literally brainwashing.",
        "processed_text": "recent push aba public_school meet student social emotional need meet aba practice operant_conditioning practice lowest order psychological conditioning operant_conditioning akin programming robot specific input lead specific output subject exhibit output expected operator form punishment administered step related punishment always removal something subject return intended output form reward administered reason aba abusive simply dictate subject need behave consideration context subject individual human literally brainwashing"
      }
    ]
  },
  {
    "topic_id": 3,
    "top_words": [
      [
        "masking",
        0.026542620733380318
      ],
      [
        "mask",
        0.022001096978783607
      ],
      [
        "need",
        0.01556407194584608
      ],
      [
        "smile",
        0.013418702408671379
      ],
      [
        "plan",
        0.01277866680175066
      ],
      [
        "polite",
        0.011151773855090141
      ],
      [
        "putting",
        0.010764384642243385
      ],
      [
        "fight",
        0.010506819002330303
      ],
      [
        "cut",
        0.010287103243172169
      ],
      [
        "nobody",
        0.010195529088377953
      ]
    ],
    "representative_docs": [
      {
        "doc_idx_in_corpus": 126,
        "topic_score": 0.6717674732208252,
        "type": "comment",
        "doc_id": "C_P_4_5766",
        "post_id": "P_4",
        "parent_post_id": "P_4",
        "subreddit": "autism",
        "keyword": "ABA",
        "submission_score": 562,
        "raw_text": "ABA often just teaches us to mask our autism and being forced to mask led me to depression, panic attacks, meltdowns, and self harm as a teen, and eventual burnout as an adult. \n\nANY child who is happy or concentrating on something or scared and trying to calm themselves...any kid in any of those situations might hum. \n\nIts normal kid behavior - but because he's autistic he's being trained like a dog to not harmlessly express a genuine emotion. \n\nA genuine emotion and emotional response that any \"normal\" child could show and nobody would think anything of it. The most they might say is \"hum a little quieter please.\"\n\nFor me that led to disconnection and disassociation from my emotions. People were able to manipulate and take advantage of me because I had no idea what my own genuine feelings were. I'd been taught to suppress all my own natural responses to any given situation.\n\nMy suggestion would be, don't teach him not to stim, just teach him about indoor voice and outdoor voice.\n\nYou cannot imagine how hard it is to need to stim but be forced to put all your attention into not stimming and masking and acting normal.\n\nImagine you're in a horror movie and you have a broken ankle, but the serial killer is looking for you. So you not only have to walk on the broken ankle, but you must do it in silence. That is the daily reality for \"housebroken\" autistic people who have been taught to mask everything that shows we are autistic. \n\nI'm sure your therapist is helping your son but just keep an eye on her to make sure that she's teaching him how to be autistic in the NT world, NOT how to totally hide and pretend not to be autistic at all.",
        "processed_text": "aba often teach u mask forced mask led depression panic_attack meltdown self_harm teen eventual burnout adult happy concentrating something scared trying calm situation hum normal behavior trained dog harmlessly express genuine emotion genuine emotion emotional response normal show nobody think anything say hum little quieter please led disconnection disassociation emotion able manipulate take_advantage idea genuine feeling taught suppress natural response given situation suggestion teach stim teach indoor voice outdoor voice cannot imagine hard need stim forced put attention stimming masking acting normal imagine horror movie broken ankle serial killer looking walk broken ankle silence daily reality housebroken taught_mask everything show sure therapist helping son keep eye sure teaching nt_world totally hide pretend"
      },
      {
        "doc_idx_in_corpus": 106,
        "topic_score": 0.5595508217811584,
        "type": "comment",
        "doc_id": "C_P_4_6648",
        "post_id": "P_4",
        "parent_post_id": "P_4",
        "subreddit": "autism",
        "keyword": "ABA",
        "submission_score": 562,
        "raw_text": "Quit the ABA Therapy. It's teaching him to suppress his stims and \"force\" him into fitting into a NT world. Mom, you need to have an epiphany and realize that that is not okay. It's the equivalent of a left-hand dominant person being forced to use their right hand.\n\nYour kid wants agency over his span of control. That, and for the ears to stop ringing. Those are the two big ones, and the ears ringing isn't going to happen be we're all screwed on that one. So YOU need to be the one to adapt to HIS sensory needs.",
        "processed_text": "quit aba therapy teaching suppress stims force fitting nt_world mom need epiphany realize okay equivalent dominant person forced use right hand want agency span control ear stop ringing big ear ringing happen screwed need adapt sensory need"
      },
      {
        "doc_idx_in_corpus": 159,
        "topic_score": 0.4494864046573639,
        "type": "comment",
        "doc_id": "C_P_5_1673",
        "post_id": "P_5",
        "parent_post_id": "P_5",
        "subreddit": "AutisticWithADHD",
        "keyword": "therapy",
        "submission_score": 54,
        "raw_text": "In my experience, when my therapists asks “How was your week?” what she really means is “What do you want to talk about today?” Sometimes therapists do this because it’s an ice breaker, or because people need help approaching the issues at hand in a roundabout way. Sometimes that’s helpful to me (if I am feeling funky and don’t know why, this can help uncover it), but if there is something specific I want to talk about that isn’t related to An Event From The Week, I usually just dive right into that instead.\n\nSome possible responses to “How was your week?” might be: \n- “I’ve been struggling with social cues. Here’s an example.”\n- “I’ve been thinking about X traumatic event that happened in the past.”\n- “My audio processing issues have been bothering me. I think I need better strategies for dealing with them.”\n\nWith these kinds of openings, my therapist might then ask follow up questions, offer suggestions or potential strategies, and/or validate my feelings and experience. I will still do the bulk of the talking, but her questions and responses usually a) help me feel like I am not “broken” or unreasonable for feeling like I do, b) help me understand the emotional roots or triggers for my feelings or behaviors, which helps me better prepare for the future and “catch” tricky situations before I have a meltdown, and c) help me develop concrete plans for accommodations, strategies, or conversational scripts to help me navigate a particular struggle.\n\nAlso, therapy itself is a great thing to talk about out in therapy! You can always open with “I’ve been thinking about our previous sessions” and share how you feel (dissatisfied, confused, not helped) and ask again for what you need (for them to ask you more specific/less open-ended questions, maybe with examples of questions that were really helpful during your evaluations). This is a totally reasonable and normal thing to do. And if nothing changes, you can always find someone new. Sometimes it ‘s just plain hard to get a good personality and modality match.",
        "processed_text": "experience therapist asks week mean want talk today sometimes therapist ice breaker need help approaching issue hand roundabout way sometimes helpful something specific want talk related event week usually dive right instead possible response week struggling social cue example thinking traumatic event happened past audio processing issue bothering think need better strategy dealing kind opening therapist ask follow question offer suggestion potential strategy validate feeling experience bulk talking question response usually help feel broken unreasonable feeling help understand emotional root trigger feeling behavior help better prepare future catch tricky situation meltdown help develop concrete plan accommodation strategy conversational script help navigate particular struggle therapy great talk therapy always open thinking previous session share feel dissatisfied confused helped ask totally reasonable normal nothing change always find someone new sometimes plain hard good personality modality match"
      },
      {
        "doc_idx_in_corpus": 31,
        "topic_score": 0.43996554613113403,
        "type": "comment",
        "doc_id": "C_P_1_7904",
        "post_id": "P_1",
        "parent_post_id": "P_1",
        "subreddit": "Autism_Parenting",
        "keyword": "ABA",
        "submission_score": 77,
        "raw_text": "It's apples and oranges. People have legitimate reasons for not putting their kids in ABA, while anti-vax stuff is based on misinformation and pseudoscience. \n\n\nAs for choosing providers, my daughter was about 22 months or so when we started ABA. Like a lot of people, we went through Early Intervention, so there was no choice of provider. They say -- this is what we're offering, you can take it or leave it. This was apparently a reputable ABA company, vendored with our county Regional Center. The technicians coming to our house to work with our daughter weren't even RBTs -- they were supervised by one, who was ultimately supervised by a BCBA who saw my daughter I think twice in the year she was in the program.\n\n\nI'm not blaming the technicians at all -- it's not their fault they're being thrown out there with no training, they need jobs like anyone else. I blame the for-profit companies who I know are getting paid a LOT by the state/private insurance to provide service by professionals. (And I would never in a million years throw shade at paraprofessional aides who work in the schools -- I used to work in an elementary school myself, I know how hard it is. The aides that work with my daughter are absolutely amazing.)",
        "processed_text": "apple orange legitimate reason putting aba stuff based misinformation pseudoscience choosing provider daughter month started aba lot went early_intervention choice provider say offering take leave apparently reputable aba company vendored county regional center technician coming house work daughter rbts supervised ultimately supervised bcba saw daughter think twice program blaming technician fault training need job anyone_else blame company getting paid lot insurance provide service professional"
      },
      {
        "doc_idx_in_corpus": 17,
        "topic_score": 0.4244643747806549,
        "type": "comment",
        "doc_id": "C_P_1_6957",
        "post_id": "P_1",
        "parent_post_id": "P_1",
        "subreddit": "Autism_Parenting",
        "keyword": "ABA",
        "submission_score": 77,
        "raw_text": "Exactly. Like what is a solution other than ABA?  OT?  Maybe for an hour a week but otherwise, we are not giving children tools to be successful. Like yeah, don’t force eye contact but also encourage it in context so autistic children can be successful in job interviews. Don’t stop stimming but let’s try to reduce self harming stims. \n\nIt’s like you said, individuals need coping skills. The world isn’t going to hold their hands forever.",
        "processed_text": "exactly solution aba maybe hour_week otherwise giving tool successful yeah force eye_contact encourage context successful job interview stop_stimming try reduce harming stims said individual need coping skill world hold hand forever"
      }
    ]
  },
  {
    "topic_id": 4,
    "top_words": [
      [
        "telling",
        0.061448805034160614
      ],
      [
        "subjected",
        0.040382981300354004
      ],
      [
        "born",
        0.02689625881612301
      ],
      [
        "little_bit",
        0.025093216449022293
      ],
      [
        "authority",
        0.0245240218937397
      ],
      [
        "reference",
        0.023987887427210808
      ],
      [
        "nightmare",
        0.023408781737089157
      ],
      [
        "filling",
        0.022280586883425713
      ],
      [
        "fell",
        0.021824242547154427
      ],
      [
        "heck",
        0.021214930340647697
      ]
    ],
    "representative_docs": [
      {
        "doc_idx_in_corpus": 108,
        "topic_score": 0.29331275820732117,
        "type": "comment",
        "doc_id": "C_P_4_1377",
        "post_id": "P_4",
        "parent_post_id": "P_4",
        "subreddit": "autism",
        "keyword": "ABA",
        "submission_score": 562,
        "raw_text": "Please take him out of ABA. Every major autistic-run org condemns it. I was subjected to it myself and left with lasting trauma, issues with prompt dependency, self-loathing and saying no. When a \"therapy\" is so widely condemned by the very population it claims to help, I wouldn't touch it with a ten foot pole, let alone subject my child to it.\n\nThere are other therapies, such as speech and occupational therapy, that don't have countless traumatized people left in their wake. The trauma doesn't usually show immediately and many do appear to be having fun/\"love\" their therapists (as I did) while it's happening, which is part of why it's so dangerous.",
        "processed_text": "please take aba major org_condemns subjected left lasting trauma issue prompt dependency saying therapy widely condemned population claim help touch ten foot pole let_alone subject therapy speech_occupational therapy countless traumatized left wake trauma usually show immediately many appear therapist happening part dangerous"
      },
      {
        "doc_idx_in_corpus": 184,
        "topic_score": 0.2798198461532593,
        "type": "comment",
        "doc_id": "C_P_7_3370",
        "post_id": "P_7",
        "parent_post_id": "P_7",
        "subreddit": "AutisticWithADHD",
        "keyword": "diagnosis",
        "submission_score": 195,
        "raw_text": "Both dsm-iv, and even more so, dsm-5 include the possibility for masking so that you \"can be social\" isn't a big thing. DSM-5 for instance says:\n\n> but may not become fully manifest until social demands exceed limited capacities or may be masked by learned strategies in later life\n\nAnd the whole \"ridgid routines\" is just one out of four examples where you need to fulfill two of them. Do if you have two out of the other three (stimming, special interest, and unusual sensory reactions/fascination) then it's irrelevant that you don't stick to routines.\n\nAnd the above is especially true since you actually also have ADHD. Being able to be social and not having fixed routines can be caused by the ADHD. Take me for instance; I love and need routines but at the same time I hate them and being trapped by them.\n\nNot jumping around the room and not interrupting others can at most indicate that you don't have the hyperactive side of adhd which would give you ADHD-pi, ie ADHD primarily inattentive which your parents telling also could support. But to expect a grown-up to display symptoms as a child is just stupid. If your adhd was that extreme as a grown-up then you would likely already have had your diagnosis as a child.",
        "processed_text": "include possibility masking social big instance say become fully manifest social demand exceed limited capacity masked learned strategy later_life whole ridgid routine example need fulfill irrelevant stick routine especially true actually adhd able social fixed routine caused adhd take instance need routine hate trapped jumping around room interrupting others indicate hyperactive side adhd give ie primarily inattentive telling support expect display symptom stupid adhd extreme likely already diagnosis"
      },
      {
        "doc_idx_in_corpus": 180,
        "topic_score": 0.2608073055744171,
        "type": "comment",
        "doc_id": "C_P_7_8638",
        "post_id": "P_7",
        "parent_post_id": "P_7",
        "subreddit": "AutisticWithADHD",
        "keyword": "diagnosis",
        "submission_score": 195,
        "raw_text": "Im 18 years old, I need the official diagnosis to show to my future school so that they can offer specific care.\n\nI have cPTSD (derealisation, depersonalization, anhedonia, depression, social anxiety, emotional flashbacks, nightmares almost every night, insomnia, concentration issues, slightly psychosis prone, feeling like an imposter)",
        "processed_text": "old need official_diagnosis show future school offer specific care cptsd derealisation depersonalization depression social_anxiety emotional flashback nightmare almost night insomnia concentration issue slightly psychosis prone feeling imposter"
      },
      {
        "doc_idx_in_corpus": 47,
        "topic_score": 0.18675951659679413,
        "type": "comment",
        "doc_id": "C_P_1_9106",
        "post_id": "P_1",
        "parent_post_id": "P_1",
        "subreddit": "Autism_Parenting",
        "keyword": "ABA",
        "submission_score": 77,
        "raw_text": "It took me years to learn to not engage confrontationally on social media. One thing that helped is understanding that doing so only made others further entrenched in their beliefs. It’s called the “backfire effect”—when people double down on beliefs despite evidence to the contrary, and almost everyone falls prey to this cognitive bias, even scientists. So you can end up doing more harm than good in these situations. \n\nYou can also take a Taoist view of the situation—all things ebb and flow. Opposition to ABA will fade as generations change. Take the long view and then do what is right for your family.",
        "processed_text": "took learn engage confrontationally social medium helped understanding made others entrenched belief called backfire double belief evidence contrary almost everyone fall prey cognitive bias scientist end harm good situation take taoist view ebb flow opposition fade generation change take long view right family"
      },
      {
        "doc_idx_in_corpus": 3954,
        "topic_score": 0.1732841283082962,
        "type": "comment",
        "doc_id": "C_P_214_6076",
        "post_id": "P_214",
        "parent_post_id": "P_214",
        "subreddit": "neurodiversity",
        "keyword": "ADHD",
        "submission_score": 30,
        "raw_text": "Reading this waking up from a nap post coffee lol. Drank the cup of coffee and within 20 minutes fell asleep. Adhd runs in my family, I haven’t been formally diagnosed but I know it is likely.",
        "processed_text": "reading waking nap post coffee lol drank cup coffee minute fell asleep adhd run family formally_diagnosed likely"
      }
    ]
  },
  {
    "topic_id": 5,
    "top_words": [
      [
        "son",
        0.032476600259542465
      ],
      [
        "word",
        0.025301774963736534
      ],
      [
        "social",
        0.019043676555156708
      ],
      [
        "poorly",
        0.01898796297609806
      ],
      [
        "extra",
        0.014425926841795444
      ],
      [
        "happening",
        0.012984015047550201
      ],
      [
        "special",
        0.012761245481669903
      ],
      [
        "ground",
        0.01208354253321886
      ],
      [
        "less",
        0.011907728388905525
      ],
      [
        "refused",
        0.011887134052813053
      ]
    ],
    "representative_docs": [
      {
        "doc_idx_in_corpus": 115,
        "topic_score": 0.4320495128631592,
        "type": "comment",
        "doc_id": "C_P_4_4809",
        "post_id": "P_4",
        "parent_post_id": "P_4",
        "subreddit": "autism",
        "keyword": "ABA",
        "submission_score": 562,
        "raw_text": "Can I borrow your son to go to Costco, that's amazing!  On a serious note, WHAT?!?, My son beat box stims or hums Mario  - in his words it soothes the anxiety.  I told all his therapist not to stop his stimming and told them all the behaviours they are not allowed to attempt to stop.  I rather my son self-soothe than become depressed or increasingly anxious.  If you stop them from self-soothing without finding a new means to soothe themselves- that cognitive distress can increase and diminish their worth.   This was what my 11 year old son told me. I have found quiet stims to mask in public but I should've never had to do this.  Now, I am embarrassed by them or shame myself internally if critized.\n\nI refuse personally ABA BUT my son is in Occupational therapy and speech therapy.",
        "processed_text": "borrow son go costco amazing serious note son beat box stims hum mario word soothes anxiety told therapist stop_stimming told behaviour allowed attempt stop rather son become depressed increasingly anxious stop finding new mean soothe cognitive distress increase diminish worth old son told found quiet stims mask public never embarrassed shame internally critized refuse personally aba son occupational_therapy speech_therapy"
      },
      {
        "doc_idx_in_corpus": 29,
        "topic_score": 0.42449915409088135,
        "type": "comment",
        "doc_id": "C_P_1_5652",
        "post_id": "P_1",
        "parent_post_id": "P_1",
        "subreddit": "Autism_Parenting",
        "keyword": "ABA",
        "submission_score": 77,
        "raw_text": "ABA for my son was another person patiently working with him on living skills like getting dressed, washing his hands after toileting, brushing his teeth on his own. It was someone who was patiently working with him on learning to answer yes/no questions, which reduced his meltdowns and self harming/aggressive behaviors significantly because he had a way to get his needs met. My son’s RBT was also autistic, they went at his pace, worked on the same things his SLP and OT were working on, and he truly loved spending time and playing with her. There was no hiding his autism, no forced eye contact, just extra help working on skills he needs to generally survive comfortably.",
        "processed_text": "aba son person patiently working living skill getting dressed washing hand toileting brushing_teeth someone patiently working learning answer question reduced meltdown self behavior significantly way met rbt went pace worked slp_ot working truly loved spending playing hiding forced eye_contact extra help working skill need generally survive comfortably"
      },
      {
        "doc_idx_in_corpus": 8,
        "topic_score": 0.42068973183631897,
        "type": "comment",
        "doc_id": "C_P_1_8428",
        "post_id": "P_1",
        "parent_post_id": "P_1",
        "subreddit": "Autism_Parenting",
        "keyword": "ABA",
        "submission_score": 77,
        "raw_text": "It’s interesting that you mention “less/more autistic.”  I’m with you in that my son is severely autistic.  But what I’ve noticed in life is that social ability matters. \n\nFor whatever reason, people like my son. They really want to form a connection with him and people loved being assigned to him. I always note to my wife that we’re lucky in that he’s friendly and attracts kind-hearted folks. He isn’t a screamer and he isn’t violent; he can speak (though it’s very repetitive a la Rain Man and he has expressive/receptive language disorder) which helps a lot. \n\nI say this because in our therapy center I saw a lot of kids who were *much* more challenging. Lack of speech; withdrawn; possibly physical issues. And sometimes with the added burden of shit parents. Those kids didn’t get nearly the attention my son did. \n\nWe were lucky - we were at an ABA program attached to a university teaching program so a lot of people interested in teaching special needs rotated in. Overall it was a great experience and really set him up for success in life. Every day he continues to amaze us with his progress.",
        "processed_text": "interesting mention son severely noticed life social ability matter reason son want form connection loved assigned always note wife lucky friendly attracts folk screamer violent speak repetitive la rain_man language disorder help lot say therapy center saw lot challenging lack speech withdrawn possibly physical issue sometimes added burden shit nearly attention son lucky aba program attached university teaching program lot interested teaching special need rotated overall great experience set success life day continues amaze u progress"
      },
      {
        "doc_idx_in_corpus": 118,
        "topic_score": 0.3377690613269806,
        "type": "comment",
        "doc_id": "C_P_4_5778",
        "post_id": "P_4",
        "parent_post_id": "P_4",
        "subreddit": "autism",
        "keyword": "ABA",
        "submission_score": 562,
        "raw_text": "tbh this is exactly what I would do, if I were a therapist. My mom and my husband do this with me (diagnosed at 25) but my husband especially has always been amazing at helping where I need it. Even while dating and 5 years pre-diagnosis, he understood me like nobody else; he thinks my stims are cute and if it’s inappropriate while we’re together in public, he holds my hand and I substitute it by rubbing his hand with my thumb. Within the first month of dating, he bought me a notebook so we could still talk when I can’t speak. And so on.\n\nBut! I mostly bring this up because I have a textbook about disabilities in children and its autism chapter is *very* pro-ABA (and it supports A$, dismisses the fact that most autistics prefer ‘autistic,’ etc). I mention this because there’s a short paragraph explicitly saying, ‘For some reason, the benefits of ABA don’t last into adulthood. Weird!’",
        "processed_text": "tbh exactly therapist mom husband husband especially always amazing helping need dating understood nobody_else think stims cute inappropriate together public hold hand substitute rubbing hand thumb first month dating bought notebook talk speak mostly bring textbook disability chapter mention short paragraph explicitly saying reason benefit aba last adulthood weird"
      },
      {
        "doc_idx_in_corpus": 67,
        "topic_score": 0.3309532105922699,
        "type": "comment",
        "doc_id": "C_P_3_3438",
        "post_id": "P_3",
        "parent_post_id": "P_3",
        "subreddit": "AutismInWomen",
        "keyword": "therapy",
        "submission_score": 214,
        "raw_text": "I love my therapist and she's done a few different modalities with me from somatic processing to IFS. It's honestly been life changing for me especially with the usual trauma/dissociation most autists grow up with. She also specializes in all these niche areas that are relevant to me, so that helps. \n\nI think it's more about finding someone you are comfortable with rather than the right modality (but since I know nothing about you, you can take that with a grain of salt). There are a lot of times in therapy where the questions feel very vague and poorly defined , but since I trust my therapist, it doesn't bother me too much. Although part of the reason I trust her is because she explains a lot of her choices with me so I have some sense of what she's trying to do.",
        "processed_text": "love therapist done different modality somatic processing ifs honestly life_changing especially usual autists grow specializes niche area relevant help think finding someone comfortable rather right modality nothing take_grain salt lot question feel vague poorly defined trust therapist part reason trust explains lot choice sense trying"
      }
    ]
  },
  {
    "topic_id": 6,
    "top_words": [
      [
        "aba",
        0.027833299711346626
      ],
      [
        "good",
        0.025116683915257454
      ],
      [
        "therapy",
        0.016279106959700584
      ],
      [
        "bad",
        0.013642865233123302
      ],
      [
        "used",
        0.010323605500161648
      ],
      [
        "use",
        0.009835436940193176
      ],
      [
        "electroshock",
        0.009316308423876762
      ],
      [
        "behavior",
        0.009084590710699558
      ],
      [
        "way",
        0.00887030828744173
      ],
      [
        "trouble",
        0.008723462000489235
      ]
    ],
    "representative_docs": [
      {
        "doc_idx_in_corpus": 96,
        "topic_score": 0.6442433595657349,
        "type": "comment",
        "doc_id": "C_P_4_5019",
        "post_id": "P_4",
        "parent_post_id": "P_4",
        "subreddit": "autism",
        "keyword": "ABA",
        "submission_score": 562,
        "raw_text": "There can be. For example, I know a person with an autistic child who caused about $20k in house damage. No one could figure out what was wrong and what led to the damage.\n\nAn ABA therapist realised that the child was thirsty and (1) didn't know how to recognise that, (2), couldn't express it, and (3), didn't know how to fix it.\n\nThe therapist helped the child learn to self-manage and quench their own thirst.\n\nThis, of course, is not a defence of ABA. I think it should be dismantled and start over; it is based on conversion therapy. Like this one with the \"quiet mouth.\"\n\nThat said, ABA practitioners have developed some effective communication and teaching techniques for people with autism.\n\nIt started out as conversion therapy, and has actually developed some Science behind it, the way alchemy was based on nonsense but observation in doing it was the foundation of modern chemistry.\n\nSo, really, I think ABA should be thrown out and the good parts of it put into a new framework, the way alchemy became chemistry. This would also help people looking for support find therapists with better principles (though there would still be bad ones, as there are horrible psychotherapists too).",
        "processed_text": "example person caused house damage figure led damage aba therapist realised thirsty recognise express fix therapist helped learn quench thirst course defence aba think dismantled start based conversion_therapy quiet mouth said aba practitioner developed effective communication teaching technique started conversion_therapy actually developed science way alchemy based nonsense observation foundation modern chemistry think thrown good part put new framework way alchemy became chemistry help looking support find therapist better principle bad horrible psychotherapist"
      },
      {
        "doc_idx_in_corpus": 86,
        "topic_score": 0.6192704439163208,
        "type": "post",
        "doc_id": "P_4",
        "post_id": "P_4",
        "parent_post_id": null,
        "subreddit": "autism",
        "keyword": "ABA",
        "submission_score": 562,
        "raw_text": "Son has started play based ABA therapy, I am worried about “quiet mouth” command that she used Hello, yesterday was the first day of my son’s (3 ) new kind of ABA. This is a play based ABA. He was playing puzzles,  reading books, running around and overall was very happy with his therapist. One thing that I am worried about is - my son hums a lot, with time it is getting louder and longer. (For example when we go to Costco he hums so loudly that other people don’t come near us) During the session every time my son was humming the therapist kept on saying “quite mouth”. My son stopped humming for sometime after she said that. Me and my husband are worried, we fully accept and understand his need to hum. What would be the best approach on this situation ? I read somewhere that biggest cause of depression among teens with autism is not being able to stim and all the restrictions they had to endure during their childhood. My son is an amazing little guy , I want to help him with his humming but what would be the best approach?",
        "processed_text": "son started play_based aba therapy worried quiet mouth command used hello yesterday first day new kind aba play_based playing puzzle reading_book running around overall happy therapist worried son hum lot getting louder longer example go costco hum loudly come u session son humming therapist kept_saying quite mouth son stopped humming sometime said husband worried fully accept understand hum best approach situation read somewhere biggest cause depression teen able stim restriction endure childhood son amazing little_guy want help humming best approach"
      },
      {
        "doc_idx_in_corpus": 12,
        "topic_score": 0.5766512155532837,
        "type": "comment",
        "doc_id": "C_P_1_8359",
        "post_id": "P_1",
        "parent_post_id": "P_1",
        "subreddit": "Autism_Parenting",
        "keyword": "ABA",
        "submission_score": 77,
        "raw_text": "This sub has a rule against ABA absolutism, whether it’s the position that ABA is always bad, or ABA is always good. In this space, I’m cautious in discussing my concerns about it, and make space for people who think highly of it.\n\nI think the idea is that this sub is not the place to engage in “the ABA argument.” I appreciate that about this sub.\n\nI feel like I can’t really respond to this post because of that rule, and I’m not sure if this post is in alignment with that rule? But if it’s possible I misunderstand the rule, and I recognize that.",
        "processed_text": "sub rule absolutism position aba always bad aba always good space cautious discussing concern space think highly think idea sub place engage aba argument appreciate sub feel respond post rule sure post alignment rule possible misunderstand rule recognize"
      },
      {
        "doc_idx_in_corpus": 36,
        "topic_score": 0.5401604771614075,
        "type": "comment",
        "doc_id": "C_P_1_150",
        "post_id": "P_1",
        "parent_post_id": "P_1",
        "subreddit": "Autism_Parenting",
        "keyword": "ABA",
        "submission_score": 77,
        "raw_text": "I don't. I tried once and realized that my son's needs are just that... his needs. Every child is different, and every ABA experience is different. Like others, I found a wonderful team of people and my son went from hitting 0 milestones at 3 years old to almost all his milestones by 5 years old. As a parent, I couldn't allow my child to be non-verbal & unsafe without trying to help him. Speech, occupational, adaptive, cognitive therapies separately did nothing. We tried 2 planes before the one we landed on so I know all centers are not the same! Just do what's best for your kiddo and scroll past it. \n\nI only downvote when I see extreme bias comments that are not reality like \"all Austistic people hate ABA\" 🙄",
        "processed_text": "tried realized need need different aba experience different others found wonderful team son went hitting milestone old almost milestone old allow unsafe trying help speech_occupational adaptive cognitive therapy separately nothing tried plane landed center best kiddo scroll past downvote see extreme bias comment reality austistic hate aba"
      },
      {
        "doc_idx_in_corpus": 5131,
        "topic_score": 0.501690149307251,
        "type": "comment",
        "doc_id": "C_P_344_7641",
        "post_id": "P_344",
        "parent_post_id": "P_344",
        "subreddit": "autism",
        "keyword": "ABA",
        "submission_score": 16,
        "raw_text": "It comes from arguing with enough ABA practitioners.\n(If I use “you” in this, it’s toward them. Sometimes they’re well-intentioned and naive of the abuses, and so these are the well-worn arguments that have to be discussed.)\n\nThe “new ABA” - where’s the proof it’s new and improved? The new ABA of today is still using shock therapy here in 2021. There’s still ABA practitioners discussing unethical things (forced eye contact, planned ignoring, withholding comfort objects, coercing behavior, and 40 hrs of therapy for preschoolers) in the present day. \n\n“Not my center” - how are we supposed to know which centers are safe? If your center believes in fair, ethical treatment, you are comfortable that other centers are not abiding by that same standard? That only some ABA is safe, and we don’t know which ones?\n\nThat the Board of Ethics specifically allows the things you, ABA practitioner, have affirmed are unethical. You think shocking people is cruel and torturous, but the BCAB says it is therapy. \n\nSee, now you understand why we call it abuse. It’s the only word that shocking a kid 31 times for not taking off their jacket could be referred to as. \n\n“Evidence-based” - well, I’ll link the evidence on which they base their mountain of therapy. ABA cures the gay, published in 1974. Is this evidence-based, or not? \n\n“ABA has changed” - well they didn’t retract the study about curing gayness, so can we point out where *they’ve* changed? \n\n“ABA is respectful” - the BCAB website is citing Ivar Lovaas on why ABA is effective. The researcher who called autistic people not human, who used the R-word to describe autistic people, who said physical abuse on children was okay, and who was implicated in insurance fraud. Also, he terrorized children for being gay. \n\nIf your practice is built on Ivar Lovaas’s “evidence-based” research, you better re-evaluate if the practice is truly safe. \n\n“Autistic people are unduly mad about ABA.” If they are the targeted group for this treatment, and they say it’s not safe, what is the argument for this treatment? That it pays the bills of ABA center owners, and provides income to RBTs? (Cue the AutismParents™️ saying it worked for *them*, even though they were not the patient.)",
        "processed_text": "come arguing enough aba practitioner new aba proof new improved new aba today using shock therapy aba practitioner discussing unethical present day center supposed center safe center belief fair ethical treatment comfortable center abiding standard aba safe board ethic specifically allows aba practitioner affirmed unethical think shocking cruel torturous bcab say therapy see understand call abuse word shocking taking jacket referred link evidence_base mountain therapy aba cure gay published aba changed retract study curing gayness point changed aba respectful bcab website citing ivar_lovaas aba effective researcher called human used describe said physical abuse okay implicated insurance fraud terrorized gay practice built ivar research better practice truly safe unduly mad aba targeted group treatment say safe argument treatment pay bill aba center owner provides income rbts cue saying worked patient"
      }
    ]
  },
  {
    "topic_id": 7,
    "top_words": [
      [
        "went",
        0.03399686887860298
      ],
      [
        "school",
        0.03245425224304199
      ],
      [
        "day",
        0.02952805906534195
      ],
      [
        "home",
        0.028170045465230942
      ],
      [
        "elementary_school",
        0.017807915806770325
      ],
      [
        "aversive",
        0.016716424375772476
      ],
      [
        "list",
        0.015071872621774673
      ],
      [
        "playing",
        0.014875425025820732
      ],
      [
        "guy",
        0.01306100282818079
      ],
      [
        "ever",
        0.012027785181999207
      ]
    ],
    "representative_docs": [
      {
        "doc_idx_in_corpus": 56,
        "topic_score": 0.5030688643455505,
        "type": "comment",
        "doc_id": "C_P_2_7218",
        "post_id": "P_2",
        "parent_post_id": "P_2",
        "subreddit": "AutisticAdults",
        "keyword": "ABA",
        "submission_score": 89,
        "raw_text": "I haven't really looked into the history of ABA, so I didn't know any of that. How twisted.\n\nIt's interesting hearing your perspective about this seeing as you've been the parent watching your child do ABA. Where I worked, I've never had a parent supervise or be present for any of it. Which is concerning.\n\nWhen I worked, I often felt that the routine that was supposed to be \"individually tailored for each child and their specific needs\", were really all the same repetitive bs. It was agonizing for me to even be there with them, sticking to the program. And I had been doing it for far less longer than they had. \n\nI was working with this kid for a while who, was extremely smart, articulate, and was real interested in computer programming/game design. He knew alot about everything really, and I just enjoyed working with him because he knew so much. I worked with him one on one, and never had any problems. Eventually, when the \"clinic\" transitioned everyone to group programs, he started getting negative marks on his chart.\n\nOne day my boss is telling me to get this kid to participate in group programs, but he tells me that he just wanted to do school work. Frustrated, he started tearing up and trying to hide it. He keeps telling me he's okay and that he just wants to be left alone. I started crying too, because I knew those repetitive programs weren't doing shit for him or anyone.\n\nDuring closing that day my boss tells me that it's okay that I cried, but that [that kid] always gets fussy and dramatic when he doesn't get what he wants, so don't feel bad.\n\nI was offended. That kid wasn't fussy, nor dramatic. He advocated, communicated his needs in that moment, and she saw it as disobedience, and took it upon herself to invalidate this kid's frustration and emotions. \n\nThat's the hypocrisy with ABA, you'll see it most with high functioning autistic children. You're supposed to teach them to be more like a neurotypical child, but then as soon as they start practicing autonomy, they're brats that need even more teaching and training. Awful shit.",
        "processed_text": "looked history aba twisted interesting hearing perspective seeing watching aba worked never supervise present concerning worked often felt routine supposed individually tailored specific need repetitive b agonizing sticking program far less longer working extremely smart articulate real interested computer design knew alot everything enjoyed working knew worked never problem eventually clinic transitioned everyone group program started getting negative mark chart day telling participate group program tell wanted school work frustrated started tearing trying hide keep telling okay want left alone started cry knew repetitive program shit anyone closing day bos tell okay cried always fussy dramatic want feel bad offended fussy dramatic advocated communicated need moment saw disobedience took upon invalidate frustration emotion hypocrisy see high_functioning supposed teach neurotypical soon start practicing autonomy brat need teaching training awful shit"
      },
      {
        "doc_idx_in_corpus": 54,
        "topic_score": 0.4088206887245178,
        "type": "comment",
        "doc_id": "C_P_2_5572",
        "post_id": "P_2",
        "parent_post_id": "P_2",
        "subreddit": "AutisticAdults",
        "keyword": "ABA",
        "submission_score": 89,
        "raw_text": "ABA builds on the work of BF Skinner and co, all of whom applied animal training and disciplinary practices on autistic children. The *idea* behind ABA, regardless of who is practicing it, is to dehumanize the individual and force them into a very narrow view of who or what they should be. \n\nForcing little children (ABA had been shown to be effective up until 18 to 24 months with massive effectiveness drop off after this period) to be and do things that aren’t natural to the child is torture. And to participate, as a parent, is to allow the BCBA to *train the adult* to accept the punitive nature of the therapy. \n\nWatching these therapies in action is akin to watching someone or some animal being hosed off with a high power water hose. It’s disturbing. The child is supposed to cry. The people are supposed to let the fear and anger overwhelm the child. And it’s all supposed to be okay. \n\nAdditionally, what I’ve found (based on nutritional concerns for my ASD child (incidentally, I’m also autistic) is that nutritionists attempting to intervene in limited dietary intake have to also deal with candy and sweets as a reward mechanism with most children who have been through ABA and who are now seeking nutrition intervention as overweight and unnecessarily unhealthy. \n\nI’m not opposed to sweets. They are, however, not a bribe or a reward and are instead something that is wanted and consumed in moderation. \n\nABA claims to be data centric and data driven, but only collects data that supports their premise. Which is flawed as children grow and develop at different rates (autism is in part marked by a delay in reaching normal developmental milestones). The data, while supporting the outcome, does not take into account nor reflect the negative emotional toll on the child or parents and caregivers. \n\nBCBAs are trained in very specific ways that often leads to them acting the same toward everyone. Which is often infantilizing and degrading. My experience with my ASD child’s BCBA (who was never permitted into the home and could only connect via Zoom) was dismissing of me as both a person and as an adult and she ignored everything I had to say. Which, for her, was really stupid as I’m the only person in the house who will allow someone to cry and will allow them to struggle to gain mastery over a skill. \n\nMany years later, my partner has worked with BCBAs who’ve transitioned into education and especially special education. I’m wary of them. My partner has indicated that the people she knows now aren’t like the BCBAs or CBTs we’ve met and dealt with in the past and that most seem to have transitioned to get away from the abusive environments. This is anecdotal, but may be true. \n\nHowever, for children with autism entering the public school system, ABA is the basis whereby many preschool and kindergarten programs case their educational and disciplinary standards. As a result of which, especially where we live, we’ve decided to keep our ASD child at home and home educated. He never need the academics of school and does need the social aspects, but his problem today is being bored by the children who don’t know as much as he does. We’ve considered hiring babysitters who are older than him who he can talk to easier. \n\nIf it weee up to me, I’d shut down every ABA company and clinic (it’s all about the money, by the way) and insist on better programs.",
        "processed_text": "aba build work bf skinner co applied animal training disciplinary practice idea aba regardless practicing dehumanize individual force narrow view forcing little aba shown effective month massive effectiveness drop period natural torture participate allow bcba train adult punitive nature therapy watching therapy action watching someone animal hosed high power water hose disturbing supposed cry supposed let fear anger overwhelm supposed okay additionally found based nutritional concern asd nutritionist attempting intervene limited dietary intake deal candy sweet reward mechanism seeking nutrition intervention overweight unnecessarily unhealthy opposed sweet however bribe reward instead something wanted consumed moderation aba claim data centric data driven collect data support premise flawed grow develop different rate data supporting outcome take_account reflect negative emotional toll caregiver bcbas trained specific way often lead acting everyone often infantilizing degrading experience asd bcba dismissing person adult ignored everything say stupid person house someone cry allow struggle gain mastery skill many later partner worked bcbas transitioned education especially special_education wary partner indicated bcbas cbts met dealt past seem transitioned away abusive environment anecdotal true however entering public_school system aba basis whereby many preschool kindergarten program case educational disciplinary standard result especially live decided keep asd home home educated never need academic school need social aspect problem today bored considered hiring babysitter older talk easier weee shut aba company clinic insist better program"
      },
      {
        "doc_idx_in_corpus": 25,
        "topic_score": 0.38644492626190186,
        "type": "comment",
        "doc_id": "C_P_1_651",
        "post_id": "P_1",
        "parent_post_id": "P_1",
        "subreddit": "Autism_Parenting",
        "keyword": "ABA",
        "submission_score": 77,
        "raw_text": "Not at all in the past. It doesn’t have to be direct abuse to be harmful. ABA was incredibly harmful to my 5 year old, and has been incredibly helpful to my 3 year old. But they have received very different therapy even at the same facility. My less autistic child gets treated almost like a regular kid and his therapy basically just looks like them playing with him - he’s had tremendous growth. My older son is more autistic and his ABA team gets so focused on trials and goals, we keep begging them to just play with him and develop his social interactions. They keep focusing on goals and trials. It’s awful. I genuinely wish I had never put him in ABA.",
        "processed_text": "direct abuse harmful aba incredibly harmful old incredibly_helpful old received different therapy facility less treated almost regular therapy basically look playing tremendous growth older son aba team focused trial goal keep begging play develop social_interaction keep focusing goal trial awful genuinely wish never put"
      },
      {
        "doc_idx_in_corpus": 105,
        "topic_score": 0.31896325945854187,
        "type": "comment",
        "doc_id": "C_P_4_1314",
        "post_id": "P_4",
        "parent_post_id": "P_4",
        "subreddit": "autism",
        "keyword": "ABA",
        "submission_score": 562,
        "raw_text": "Is there an alternative? ABA is the only therapy I ever hear about. According to therapists I’ve talked to, it’s uses a token/reward system to teach kids skills like using the bathroom and redirecting/stopping harmful stims like hitting themselves\n\nObviously I take their claims with a grain of salt, but like—it gets me all mixed up as to any benefits of ABA. It’s hard for me to articulate myself well in conversation, so I feel ill-equipped to argue against it with ppl. I currently have a bit of a platform irl to speak against it, but it’s attended/run by ABA therapists and parents, and I don’t want to burn any bridges.\n\nI’ve never seen/been in it, so I only know that parents *love* it and autistics *hate* it. And the only evidence I can find for its efficacy, or lack thereof, is anecdotal. Which is great, but ppl aren’t swayed by ‘I heard on the internet...’",
        "processed_text": "alternative aba therapy ever hear according therapist talked system teach skill using bathroom harmful_stims hitting obviously take claim grain_salt mixed benefit aba hard articulate conversation feel argue ppl currently bit platform irl speak aba therapist want burn bridge never love autistics hate evidence find efficacy lack thereof anecdotal great ppl swayed heard internet"
      },
      {
        "doc_idx_in_corpus": 544,
        "topic_score": 0.31629231572151184,
        "type": "comment",
        "doc_id": "C_P_22_2841",
        "post_id": "P_22",
        "parent_post_id": "P_22",
        "subreddit": "AskAutism",
        "keyword": "ABA",
        "submission_score": 18,
        "raw_text": "The problem isn’t necessarily the theory. \n\nSee undesirable habit. Try to target that habit with reinforcement.\n\nThe problem is: changing actions that don’t cause harm and negative reinforcement.\n\nIn autism, there are many many stims that can be harmful: skin picking, chewing arms/hands, screaming at different sensations such as water, etc\n\nBUT ABA has a history of trying to turn the child “normal” so even non harmful stims and behaviors (not looking people in the eyes) get “hammered out”\n\nThat and my opinion personally? Negative reinforcement isn’t needed or can be replaced with positive/neutral reinforcement.\n\nFor example: student is biting. Reading a social story about biting after an incident. Reward with their special interest (dinosaur stickers!) when they go a day without biting. \n\nSources: I am autistic and a special education teacher",
        "processed_text": "problem necessarily theory see undesirable habit try target habit reinforcement problem changing action cause_harm negative_reinforcement many many stims harmful skin picking chewing screaming different sensation water aba history trying turn normal non harmful_stims looking eye hammered opinion personally negative_reinforcement needed replaced reinforcement example student biting reading social story biting incident reward special_interest go day biting source special_education teacher"
      }
    ]
  },
  {
    "topic_id": 8,
    "top_words": [
      [
        "therapy",
        0.03657222166657448
      ],
      [
        "feel",
        0.025755733251571655
      ],
      [
        "therapist",
        0.024741023778915405
      ],
      [
        "dentist",
        0.022888002917170525
      ],
      [
        "work",
        0.017539160326123238
      ],
      [
        "help",
        0.016233108937740326
      ],
      [
        "want",
        0.011151393875479698
      ],
      [
        "look",
        0.010471408255398273
      ],
      [
        "last",
        0.009680208750069141
      ],
      [
        "lot",
        0.009225970134139061
      ]
    ],
    "representative_docs": [
      {
        "doc_idx_in_corpus": 157,
        "topic_score": 0.7207121849060059,
        "type": "comment",
        "doc_id": "C_P_5_2662",
        "post_id": "P_5",
        "parent_post_id": "P_5",
        "subreddit": "AutisticWithADHD",
        "keyword": "therapy",
        "submission_score": 54,
        "raw_text": "I think you kind of nailed it towards the end of the post: what exactly do you expect the therapist to do? (Genuine question!) If you already worked out all angles, motivations, key take-away and so on for every situation you encountered, it doesn't really leave anything to do for the therapist. Usually they help you work out all those things. It's like you have a cleaner come over to clean up your home for an hour and upon their arrival they see that you already did a deep clean. Then you go around showing them everything like \"I cleaned this!\", \"I cleaned that, too\" and all they can do is say that you really did clean it spotlessly. For them it might not feel as pointless as it does to you, because many people just need this outside validation, if you don't tell them they have no way of knowing that the whole thing feels pointless for you.\n\n\nThere are different kinds of therapy, things like CBT, psychoanalysis, systemic therapy and more. So maybe think about what you want from therapy and try a different therapist that works a different approach? You can even talk this out with your current therapist! You're not just allowed to voice your frustrations (even about them), you're actually supposed to do that! They should also know more about the different kinds of therapy and help you pick one that better fits your needs.\n\n\nETA: you also don't **have** to do therapy just because you have AuDHD! If you struggle and feel like therapy could help, sure, give it a try. But your post reads a bit like you feel like you should try therapy cause that's what is done.",
        "processed_text": "think kind nailed towards end post exactly expect therapist already worked angle motivation key situation encountered leave anything therapist usually help work cleaner come clean home hour arrival see already deep clean go showing everything cleaned cleaned say clean spotlessly feel pointless many need outside validation tell way knowing whole feel pointless different kind therapy cbt psychoanalysis systemic therapy maybe think want therapy try different therapist work different approach talk current_therapist allowed voice frustration actually supposed different kind therapy help pick better fit need eta therapy audhd struggle feel therapy help sure give try post read bit feel try therapy cause done"
      },
      {
        "doc_idx_in_corpus": 154,
        "topic_score": 0.6202274560928345,
        "type": "post",
        "doc_id": "P_5",
        "post_id": "P_5",
        "parent_post_id": null,
        "subreddit": "AutisticWithADHD",
        "keyword": "therapy",
        "submission_score": 54,
        "raw_text": "Psych eval was so engaging! Now, doing therapy, it seems so useless As a young adult, after learning I had ADHD (thanks to a otolaryngologist, of all specialties, after noticing I had perfect hearing and my issue was audio processing related), I thought it would be prudent to try therapy... The sessions were just asking me \"how was your week?\" and awkward silence most of the time, to the point that the therapist said I should look for someone else.\n\nOver a decade later, I was searching some issues my kids have, to try to accommodate them (seeing that I had had similar issues that were poorly dealt with by unwilling parents, and didn't want my kids to feel like I did). I noticed most things were mentioned in relation to ASD, so I decided to do the neuropsych eval for ASD for myself.\n\nThe evaluation was very engaging and interesting, with a lot of back-and-forth, a lot of questions, explanations, positive discussions, and time flew by. So I decided that I should try again counseling. This time I made a point to choose someone that mentioned having had worked with ASD and AHDH. \n\nDuring my first session, I specifically mentioned that the \"how was your week?\" type of \"therapy\" doesn't work for me, and that I **needed** the therapist to actually ask me stuff. I explained general things about me, like having suffered abuse and, mainly, that I am AuADHD, being that the reason I was there; then I further detailed my issues, like inaptitude understanding social queues.\n\nNevertheless, my warnings, requests and saying the reason for being there seem to have fallen in deaf ears, for all we do is the stupid \"how was your week?\" routine... Now I sigh when I see therapy day has arrived, for the awkwardness and uselessness of it quite annoys me. When I try to scrape situations to talk about, all I get is the guy basically agreeing with me. I guess since I already know how the situation made me feel, why and mention the possible ways of dealing with it, there's nothing more for him to do aside from agreeing?\n\nIs that all therapy is about? I've had more engaging conversations talking by myself. \n\nI've tried looking some other related questions here and what I took from those is that yeah, there doesn't seem to be much more to counseling than that.\n\nSo, my question is more like, isn't there a way to have counseling/therapy that is engaging like I had with the neuropsych evaluation? (the engaging part, questions and so on; not the evaluation part, obviously). What am I missing?",
        "processed_text": "psych_eval engaging therapy seems useless young_adult learning adhd thanks otolaryngologist specialty noticing perfect hearing issue audio processing related thought prudent try therapy session asking week awkward silence point therapist said look someone_else decade later searching issue try accommodate noticed mentioned relation asd decided neuropsych eval asd evaluation engaging interesting lot lot question explanation positive discussion flew decided try counseling made point choose someone mentioned worked ahdh first session specifically mentioned week type therapy work needed therapist actually ask stuff explained general suffered abuse mainly auadhd reason detailed issue inaptitude understanding social queue nevertheless warning request saying reason seem fallen deaf ear stupid week routine sigh see therapy day arrived awkwardness uselessness quite annoys try scrape situation talk guy basically agreeing guess already situation made feel mention possible way dealing nothing aside agreeing therapy engaging conversation talking tried looking related question took yeah seem counseling question way engaging neuropsych evaluation engaging part question evaluation part obviously missing"
      },
      {
        "doc_idx_in_corpus": 83,
        "topic_score": 0.5852302312850952,
        "type": "comment",
        "doc_id": "C_P_3_761",
        "post_id": "P_3",
        "parent_post_id": "P_3",
        "subreddit": "AutismInWomen",
        "keyword": "therapy",
        "submission_score": 214,
        "raw_text": "Yes, and it can be hard to find the right person for the right season of your life. I’ve had 4 therapists over the years- two I loved and two that just totally didn’t gel w me\n\nI’ve learned: I try to prepare what I want to talk about bc I like to get “the best bang for my buck” in terms of items I want help w\nI am direct in that specific homework helps me get the most out of therapy and both of the great therapists above have absolutely welcomed that feedback",
        "processed_text": "yes hard find right person right season life therapist loved totally gel learned try prepare want talk bc best bang buck term item want help direct specific homework help therapy great therapist absolutely welcomed feedback"
      },
      {
        "doc_idx_in_corpus": 2968,
        "topic_score": 0.5774151682853699,
        "type": "comment",
        "doc_id": "C_P_140_1070",
        "post_id": "P_140",
        "parent_post_id": "P_140",
        "subreddit": "autism",
        "keyword": "therapy",
        "submission_score": 1058,
        "raw_text": "I would absolutely recommend engaging with neurodivergent affirming therapists, or alternate types of therapy outside of talk therapy. The best work I've done has been with an art therapist & a somatic therapist. Definitely encourage engaging in more body work, over brain work - I can logic my way through anything, but actually connecting with how my body feels? HARD!",
        "processed_text": "absolutely recommend engaging neurodivergent_affirming therapist alternate type therapy talk therapy best work done art therapist somatic therapist definitely encourage engaging body work brain work logic way anything actually connecting body feel hard"
      },
      {
        "doc_idx_in_corpus": 73,
        "topic_score": 0.570770800113678,
        "type": "comment",
        "doc_id": "C_P_3_8216",
        "post_id": "P_3",
        "parent_post_id": "P_3",
        "subreddit": "AutismInWomen",
        "keyword": "therapy",
        "submission_score": 214,
        "raw_text": "Yes. Lots of different therapies that can work for autistic people. First I did gestalt and learned how to identify emotions in my body. This was key basic groundwork. Then I have done psychodynamic and psychoanalytic. Also awesome. The best of all has been Jungian dream therapy. \n\ndo NOT do CBT. It doesn’t work for autistic bc it’s all lying to yourself to change your mind and we by definition cannot do that.",
        "processed_text": "yes lot different therapy work first gestalt learned identify emotion body key basic groundwork done psychodynamic psychoanalytic awesome best jungian dream therapy cbt work bc lying change mind definition cannot"
      }
    ]
  },
  {
    "topic_id": 9,
    "top_words": [
      [
        "mental_health",
        0.021379388868808746
      ],
      [
        "personal",
        0.01992107182741165
      ],
      [
        "suck",
        0.017053423449397087
      ],
      [
        "insurance",
        0.016643477603793144
      ],
      [
        "advice",
        0.014834700152277946
      ],
      [
        "hospital",
        0.014594683423638344
      ],
      [
        "disability",
        0.01408340036869049
      ],
      [
        "diagnosis",
        0.013133282773196697
      ],
      [
        "disorder",
        0.012298383750021458
      ],
      [
        "expensive",
        0.012120605446398258
      ]
    ],
    "representative_docs": [
      {
        "doc_idx_in_corpus": 190,
        "topic_score": 0.5077073574066162,
        "type": "comment",
        "doc_id": "C_P_7_3557",
        "post_id": "P_7",
        "parent_post_id": "P_7",
        "subreddit": "AutisticWithADHD",
        "keyword": "diagnosis",
        "submission_score": 195,
        "raw_text": "Are you afab? You are much less likely to be taken seriously. I highly recommend a second opinion. The DSM5 was written on the symptoms of white Cis boys and does not fully encompass or represent the symptoms experienced by the rest of the population for a very real disability. \nComorbid adhd and autism can cover eachothers symptoms, outwardly appearing less severe while the internal experience is debilitating. \nThere are additional resources like talk with Frida, for adhd and if you are in canada, embrace autism (an internet  diagnostic space run by a autistic psychiatrist with an additional phd) \nThe medical system is incredibly invalidating and traumatic for medically complex and disabled people, I'm sorry you're having to deal with this on top of the batshit allistic way we are required to navigate it for help. \nHaving either adhd or autism unless you've got a diagnosis and incredibly supportive parents and mental health structures is almost guaranteed to traumatize you. \n\nBy age 10 it's estimated that you've received an additional 20,000 negative or corrective messages in comparison to your peers (Dr Russell Barkley). That being placed on a child who doesn't understand what's happening or why they feel different, will internalize that shame and almost always develop an anxiety disorder as a means of hypervigilence to avoid additional negative consequences for what they perceive as simply existing. \n\nYou're doing great, the medical system sucks. Get a second opinion, and maybe warn the psychiatrist that your parents were abusive and or are ableist.",
        "processed_text": "afab less_likely taken_seriously highly_recommend second_opinion written symptom white ci boy fully encompass represent symptom experienced rest population real disability comorbid adhd cover eachothers symptom outwardly appearing less severe internal experience debilitating additional resource talk frida canada embrace medical_system incredibly invalidating traumatic medically complex disabled sorry deal top batshit allistic way required navigate help adhd diagnosis incredibly supportive mental_health structure almost guaranteed traumatize age estimated received additional negative corrective message comparison peer placed understand happening feel different internalize shame almost always develop anxiety_disorder mean hypervigilence avoid additional negative consequence perceive simply existing great medical_system suck second_opinion maybe warn psychiatrist abusive ableist"
      },
      {
        "doc_idx_in_corpus": 189,
        "topic_score": 0.42826974391937256,
        "type": "comment",
        "doc_id": "C_P_7_2461",
        "post_id": "P_7",
        "parent_post_id": "P_7",
        "subreddit": "AutisticWithADHD",
        "keyword": "diagnosis",
        "submission_score": 195,
        "raw_text": "I hope some of the comments here haven't got you too down OP, some people are keen to mind everyone's business except their own. That aside, genuinely sorry you've had this experience and can only imagine how upsetting it probably was to feel validated initially by the results and then... get a peek under the hood.\n\nI'm glad you'll be seeking a second opinion and I wish you the best of luck. Come Prepared. Raise Hell if need be. If your parents aren't particularly helpful with the diagnostic process, I would not include them in it if at all possible. I hope you can get some answers soon that aren't based on extremely outdated information. In the meantime just keep your head held high!!\n\n(And I know the idea of having ADHD, especially alongside autism, might not be comforting.. but there are certainly ways forward. Treatment-wise, but also knowledge and personal growth will take you far. If you do get the diagnosis, try to see it as your chance for a new, better beginning at the end of the day)",
        "processed_text": "hope comment op keen mind business aside genuinely sorry experience imagine upsetting probably feel validated initially result peek hood glad seeking second_opinion wish_best luck come prepared raise hell need particularly helpful diagnostic_process include possible hope answer soon based extremely outdated information meantime keep head held high idea adhd especially alongside comforting certainly way forward knowledge personal growth take far diagnosis try see chance new better beginning end_day"
      },
      {
        "doc_idx_in_corpus": 1670,
        "topic_score": 0.34468212723731995,
        "type": "comment",
        "doc_id": "C_P_60_816",
        "post_id": "P_60",
        "parent_post_id": "P_60",
        "subreddit": "AutismInWomen",
        "keyword": "diagnosis",
        "submission_score": 167,
        "raw_text": "In the US, my state has tried to make laws denying gender affirming care to autistic adults. While I do not require gender affirming care, the fact that laws can be made to control medical care based on diagnosis is terrifying. Will autistic lives be devalued in the next pandemic? Maybe.",
        "processed_text": "u state tried law denying gender_affirming care adult require gender_affirming care fact law made control medical care based diagnosis terrifying life devalued next pandemic maybe"
      },
      {
        "doc_idx_in_corpus": 777,
        "topic_score": 0.3259687125682831,
        "type": "comment",
        "doc_id": "C_P_31_1392",
        "post_id": "P_31",
        "parent_post_id": "P_31",
        "subreddit": "AutismInWomen",
        "keyword": "diagnosis",
        "submission_score": 1146,
        "raw_text": "There’s definitely financial ramifications like higher insurance rates as OP has encountered but there’s also the cost of diagnosis itself, it could easily number in the thousands. Especially so considering there aren’t a ton of insurances available that even cover adult autism assessment. Never mind that most assessors aren’t qualified to assess autism in adults and won’t even see them. \n\nAnother financial problem is that many employers don’t see autistic people as as competent as their allistic counterparts and while it’s illegal to discriminate on the basis of disability, it’s still happening and it’s very hard to prove. Formally diagnosed individuals are statistically underemployed and tend to struggle with money, not as result of being autistic but because of the stigma associated with being seen as “unemployable” due to having autism. \n\nThere are social ramifications too, autistic people are infantilized, seen as inhuman, antisocial, emotionally and mentally stunted. None of these things are true of course but the stigma persists. While it’s fine to say you don’t have to disclose your autism, in the realm of medicine where your medical records are public knowledge to nearly every provider you see… it can, and does, cause huge issues for a lot of people. We’re far more likely to receive inadequate care and less autonomy regarding treatment as a result. \n\nSpeaking of medical issues regarding formal diagnosis, did you know you can be denied an organ transplant based on your autism? Did you also know that autistic people *frequently* end up having do not resuscitate orders added to their medical records without their knowledge? Did you know that during the height of the pandemic when the US were rationing ventilators and critical care beds, 27 states adopted policies that could deny care to disabled individuals, especially people with cognitive disabilities like autism. And that’s not even the tip of the iceberg when it comes to the medical mistreatment of autistic people. \n\nThen there are the legal issues, formally diagnosed autistic individuals can and have lost their autonomy *entirely.* Forcibly put under conservatorships and guardianships, can and do lose their right to consent, get married, take out loans, sign contracts, etc. \n\nThey can *also* lose their children and frequently do. And I truly do mean, frequently. At a rate of up to 80% depending where you are. There’s this overwhelming stigma that cognitively disabled people shouldn’t raise children and it shows. Every state in the US allows disability to be considered as a reason for termination of custody. You can legally be deemed an unfit parent because you’re autistic and non-disabled parents are overwhelmingly favored over disabled parents. This can and does sometimes extend to trying to adopt or seek out an egg or sperm donor too. If you seek out permanent birth control, you can be denied that on the grounds of being autistic too. So even your reproductive rights can be on the line. \n\nMany countries have laws in place that prevent autistic people from immigrating, a formal diagnosis can prevent trans individuals from receiving gender affirming care, and so many more reasons. The list as to how it can harm you is sadly very *long.* :/",
        "processed_text": "definitely financial ramification higher insurance rate op encountered cost diagnosis easily number thousand especially considering ton insurance available cover adult assessment never mind assessor qualified assess adult see financial problem many employer see competent allistic counterpart illegal discriminate basis disability happening hard prove formally_diagnosed individual statistically underemployed tend struggle money result stigma associated seen unemployable due social ramification infantilized seen inhuman antisocial emotionally mentally stunted none true course stigma persists fine say disclose realm medicine medical_record public knowledge nearly provider see cause huge issue lot far likely receive inadequate care less autonomy regarding treatment result speaking medical issue regarding formal_diagnosis denied organ transplant based frequently end resuscitate order added medical_record knowledge height pandemic u rationing ventilator critical care bed state adopted policy deny care disabled individual especially cognitive disability tip iceberg come medical mistreatment legal issue formally_diagnosed individual lost autonomy entirely forcibly put conservatorships guardianship lose right consent married take loan sign contract lose frequently truly mean frequently rate depending overwhelming stigma cognitively disabled raise show state u allows disability considered reason termination custody legally deemed unfit overwhelmingly favored disabled sometimes extend trying adopt seek egg sperm donor seek permanent birth control denied ground reproductive right line many country law place prevent immigrating formal_diagnosis prevent trans individual receiving gender_affirming care many reason list harm sadly long"
      },
      {
        "doc_idx_in_corpus": 790,
        "topic_score": 0.31961625814437866,
        "type": "comment",
        "doc_id": "C_P_31_233",
        "post_id": "P_31",
        "parent_post_id": "P_31",
        "subreddit": "AutismInWomen",
        "keyword": "diagnosis",
        "submission_score": 1146,
        "raw_text": "In addition to these reasons, there are also the anti-trans laws coming out that list autism as a comorbidity, and use it as a determining factor for care. For example one law that was recently passed outlines that an autism screening is required as part of one's request for gender affirming care, and if an autism diagnosis is given, they will *not* provide general affirming care.",
        "processed_text": "addition reason law coming list comorbidity use determining factor care example law recently passed outline screening required part request gender_affirming care diagnosis given provide general affirming_care"
      }
    ]
  }
]